In [1]:
import numpy as np
import pandas as pd

In [2]:
df=pd.DataFrame({'col1':[1,2,3,4],'col2':[444,555,666,444],'col3':['abc','def','ghi','xyz']})

In [3]:
df

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [5]:
df.head()

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [6]:
df['col2'].unique()

array([444, 555, 666], dtype=int64)

In [7]:
len(df['col2'].unique())

3

In [8]:
df['col2'].value_counts()

444    2
666    1
555    1
Name: col2, dtype: int64

In [9]:
df['col1']>2

0    False
1    False
2     True
3     True
Name: col1, dtype: bool

In [10]:
df[df['col1']>1]

   col1  col2 col3
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [11]:
df['col1'].sum()

10

In [14]:
def times2(x):
    return x*2

In [15]:
df['col1'].apply(times2)

0    2
1    4
2    6
3    8
Name: col1, dtype: int64

In [16]:
df

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [17]:
df.drop('col1',axis=1)

   col2 col3
0   444  abc
1   555  def
2   666  ghi
3   444  xyz

In [18]:
df

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [19]:
df.drop('col1',axis=1,inplace=True)   # permanently deletes that column

In [26]:
df

   col2 col3
0   444  abc
1   555  def
2   666  ghi
3   444  xyz

In [21]:
df.sort_values('col2')     # but see the indexes

   col2 col3
0   444  abc
3   444  xyz
1   555  def
2   666  ghi

In [22]:
df.sort_values(by='col2')

   col2 col3
0   444  abc
3   444  xyz
1   555  def
2   666  ghi

In [27]:
df=pd.DataFrame({'col1':[1,2,3,4],'col2':[444,555,666,444],'col3':['abc','def','ghi','xyz']})

In [28]:
df

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [29]:
df.isnull()

    col1   col2   col3
0  False  False  False
1  False  False  False
2  False  False  False
3  False  False  False